Autodesk.Revit.DB.Architecture.Railing.IsValidPathForRailing(Autodesk.Revit.DB.CurveLoop)
Checks whether a railing can be created along a railing path.
Remarks:
The railing path should be located on the same horizontal plane and it should contain lines or arcs only.
It also has to be continuous and its three or more curves cannot meet in one end point.
curveLoop:
The railing path along which the new railing will be created.
Returns:
True if the new railing path can be used in a railing definition, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.Railing.IsValidHostForNewRailing(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether new railing can be created and placed on the specified host.
Remarks:
This function will return true for stairs or ramps which can host new railings.
Stairs or ramps can host new railings only when they have no associated railing and they are not in editing mode.
document:
The document.
elementId:
The element to check.
Returns:
True if new railing can be created and placed on the host, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.ResetSupportPosition
Resets the continuous rails support subelements position data.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.GetSubelementOnLevel(Autodesk.Revit.DB.ElementId)
Gets the subelement on given level.
Remarks:
The method is valid only for railings hosted by stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs.
Input level should be a level of the railing stairs.
See getStairsPlacementLevels method of Autodesk.Revit.DB.Architecture.MultistoryStairs.
levelId:
The id of the level the railing subelement is placed on.
Returns:
The subelement in given level.
null will be returned if railing has no subelements on given level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The railing is not hosted by stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs.
Since:
2018

Autodesk.Revit.DB.Architecture.Railing.SetMultistoryStairsPlacementLevels(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Sets the ids of the base levels of the stairs upon which this railing is placed.
Remarks:
The method is valid only for railings hosted by stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs.
The input level ids have to be a subset of level ids of the railing stairs.
See Autodesk.Revit.DB.Architecture.MultistoryStairs for information about the placement levels that may be passed as input.
levelIds:
The ids of levels the railing is placed on.
If input level id set is empty, railings will placed on all levels of the hosting stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
All of the level ids in levelIds must be placement levels of stairs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The railing is not hosted by stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs.
Since:
2018

Autodesk.Revit.DB.Architecture.Railing.GetMultistoryStairsPlacementLevels
Gets the ids of the base levels of the stairs upon which this railing is placed.
Remarks:
The method is valid only for railings hosted by stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs.
Returns:
The ids of levels the railing is placed on.
The returned set consists of a subset of the base level ids of the corresponding stairs in the Autodesk.Revit.DB.Architecture.MultistoryStairs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The railing is not hosted by stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs.
Since:
2018

Autodesk.Revit.DB.Architecture.Railing.RemoveHost
Removes the association between the railing and its host.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.Flip
Flips the railing.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The railing has incorrect internal data.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.Reset
Resets the railing to the default one that the system generates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot reset the railing.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.GetHandRails
Get all the handrails of the railing.
Returns:
All handrails of the railing.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.RailingCanBeHostedByElement(Autodesk.Revit.DB.ElementId)
Checks whether the specified element can be used as a host for the railing.
The host can be:
stairsstairs componentrampfloorslab edgewallroof
hostId:
Element id to check.
Returns:
True if the element can be used as host for the railing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Architecture.Railing.SetPath(Autodesk.Revit.DB.CurveLoop)
Sets the railing path.
curveLoop:
The railing path along which the new railing will be created.
The curveLoop should be continuous with curves which are only bounded lines and arcs on the same horizontal plane.
It also has to have maximum two curves meet in one end point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curveLoop must be a single connected path, located on the same horizontal plane and defined using lines or arcs only.
It also has to have maximum two curves meet in one end point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The railing has incorrect internal data.
Since:
2017

Autodesk.Revit.DB.Architecture.Railing.GetPath
Gets the railing path.
Returns:
The curve array of the railing path.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The railing has incorrect internal data.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Architecture.RailingPlacementPosition)
Creates new railings with the specified railing type on all sides of a stairs instance in a Autodesk.Revit.DB.Architecture.MultistoryStairs element.
document:
The document.
multistoryStairsId:
The id of the Autodesk.Revit.DB.Architecture.MultistoryStairs that contains the stairs which will be the host of this railing.
The stairs should have no associated railings yet.
levelId:
The level of stairs on which the new railing will be created.
The level should be one of levels defining the Autodesk.Revit.DB.Architecture.MultistoryStairs element.
railingTypeId:
The railing type of the new railing to be created.
placePosition:
The placement position of the new railing.
Returns:
The new railing instances successfully created on the stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The railingTypeId is not a railing type.
-or-
The ElementId levelId is not a Level.
-or-
The levelId is not a level of Autodesk.Revit.DB.Architecture.MultistoryStairs stairs element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The multistoryStairsId already has associated railings or is in editing mode so association of railings is not permitted.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new railing by specifying the railing path in the project document.
document:
The document.
curveLoop:
The railing path along which the new railing will be created.
The curveLoop should be continuous with curves which are only bounded lines and arcs on the same horizontal plane.
It also has to have maximum two curves meet in one end point.
railingTypeId:
The railing type of the new railing to be created.
baseLevelId:
The base level on which the new railing will be created.
Returns:
The new railing instance if creation was successful, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curveLoop must be a single connected path, located on the same horizontal plane and defined using lines or arcs only.
It also has to have maximum two curves meet in one end point.
-or-
The railingTypeId is not a railing type.
-or-
The ElementId baseLevelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Architecture.RailingPlacementPosition)
Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element.
document:
The document.
stairsOrRampId:
The stairs or ramp to which the new railing will host.
The stairs or ramp should have no associated railings yet.
If the stairs are a part of Autodesk.Revit.DB.Architecture.MultistoryStairs element railings will be populated on all levels.
railingTypeId:
The railing type of the new railing to be created.
placePosition:
The placement position of the new railing.
Returns:
The new railing instances successfully created on the stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsOrRampId is not a stairs or ramp element.
-or-
The railingTypeId is not a railing type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairsOrRampId already has associated railings or is in editing mode so association of railings is not permitted.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.CanReset
True if the railing can be reset, False otherwise.
Remarks:
A Railing can be reset only if the railing was created in Revit later than version 9.1.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.IsDefault
Indicates if the railing is the default one that system generates.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.TopRail
The top rail of the railing.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.Flipped
Indicates if the railing is flipped.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The railing has incorrect internal data.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.HasHost
Indicates if the railing has a host.
Since:
2013

Autodesk.Revit.DB.Architecture.Railing.HostId
The host of the railing.
Remarks:
If the host will be a Stairs in Autodesk.Revit.DB.Architecture.MultistoryStairs element, use Autodesk.Revit.DB.Architecture.Railing.SetMultistoryStairsPlacementLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId}) to set the base levels of the stairs where the railing should be placed.
If %hostId% is the id of a Stairs Component (Run or Landing), it means that the Railing will be hosted by the Stairs element but railing adjustment to the stairs will start from the Component.
If a stairs id is set as a host, the lowest stairs component below or above the railing sketch will be chosen as the host instead.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The hostId is not a valid railing host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.Railing
Represents a railing element in Autodesk Revit.
Since:
2013